{"meta":{"title":"阿黄的博客","subtitle":"","description":"","author":"黄志昊","url":"http://example.com","root":"/"},"pages":[{"title":"","text":"","path":"tag/index.html"},{"title":"","text":"","path":"category/index.html"},{"title":"tags","text":"","path":"tags/index.html"},{"title":"categories","text":"","path":"categories/index.html"}],"posts":[{"title":"关注阿黄喵，关注阿黄谢谢喵","text":"​ 大家好，这里是阿黄的博客喵，截止2023年为止阿黄是一名福州大学计算机科学与技术第二学士学位的学士喵，阿黄会在自己的博客更新一些阿黄自己最近的动态以及完成项目的说明，感谢大家的关注喵！ 什么是阿黄？​ 首先，阿黄是一名福州大学计算机科学与技术（第二学士学位）的学生喵，阿黄的第一学位专业是生物工程，所以刚开始学习计算机二学位的课程犹如读无字天书喵，不过阿黄挺过来了喵，阿黄的成绩不错喵！ 阿黄的成绩​ 阿黄的两个学位成绩均为专业第一： 生物工程专业的绩点是3.47&#x2F;4，排名1&#x2F;55； 计算机科学与技术的绩点是3.83&#x2F;4 ，排名 1&#x2F;26； !](&#x2F;imgs&#x2F;Screenshot_20230908_192015_com.helper.west2ol.fzu.jpg) !](&#x2F;imgs&#x2F;Screenshot_20230908_193524_com.helper.west2ol.fzu.jpg) ​ 从上可以看出阿黄的成绩还不错喵，虽然阿黄学得比较慢，但阿黄会努力完成软件工程的任务的喵！ 阿黄的成果​ 在进入了计算机科学与技术专业的学习之后，阿黄就完成了诸多课程设计任务的绝大部分内容喵，因为很多同学都是从零学起，所以很多项目很多部分难以实现合作喵，因为大家都不会喵。为了能让项目尽快得完成，阿黄几乎一个人完成了很多“多人”项目的绝大部分工作，包括web前端布局以及实现，前后端内容工作的对接，数据库的在简单项目中的使用以及所有项目后端部分的撰写，所以阿黄现在算一个超超超低配的全栈工程师了喵。截止目前为止，阿黄基本上独立完成的项目有： 1、智慧食堂点餐系统!](&#x2F;%E7%82%B9%E9%A4%90%E7%B3%BB%E7%BB%9F.png) !](&#x2F;%E7%82%B9%E9%A4%90%E7%B3%BB%E7%BB%9F2.png) !](&#x2F;%E7%82%B9%E9%A4%90%E7%B3%BB%E7%BB%9F3.png) ​ 完了完成这个系统独自一个人熬了7个大夜，感觉差点完蛋了喵，但基本上实现了老师的所有要求，包括但不限于消费端的菜品分类，购物车，食品配料展示，购物车（下订单结算，增减内容物，扣款以及余额不足提醒），厨师端的订单展现，排队等待展示，订单完成确定，点单结果分析等等功能，是我做过最完善的一个项目喵。 2、SDN课程网络流量情况监控设计!](&#x2F;image-20230428213225224.png) !](&#x2F;image-20230428213328876.png) !](&#x2F;image-20230428213340681.png) !](&#x2F;image-20230428215209675.png) ​ 在这个项目中，我通过P4代码编程的方式，实现了对虚拟网络交换机不同端口的流量的实时监控以及通过web前端页面进行动态下发p4runtime规则，实现了四个p4实验代码功能的综合以及前后端交互操控网络的实现。这个项目队友帮我完成了两份说明PPT以及前端页面的部分布局，其余所有部分有我完成，所以这个项目又很大程度锻炼了我整个大项目撰写以及前后端分别完成后互联的能力。 3、数据可视化–Steam游戏数据销售可视化项目!](&#x2F;%E5%8F%AF%E8%A7%86%E5%8C%96%E5%8E%9F%E5%9E%8B%E5%9B%BE.png) ​ 在本次项目中，又是由我一人从数据清洗、数据处理到可视化展现通通一人独自处理的项目，首先我从github上面找到未经处理的steam游戏销售数据，然后对数据进行处理，抽出每一个数据的销量、单价、标签、类型、年份、以及开发工作室。之后使用当时最流行的chatgpt把所有工作室的所在地问一遍（是的，steam没有给游戏产出国，需要我自己寻找，感谢chatgpt）,这样我就得到了所有游戏的产出国，之后对销售数据进行可视化，最终对销售数据进行可视化，最终得到了每一个国家的游戏产出价值可视化展示。 阿黄的能力​ 除了上述三个课程设计，阿黄还做过好几个小项目喵。综上可以看出，在经过一年计算机课程毒打的情况下，阿黄已经拥有了一个程序员的基本素养了喵，现在基本可以做到： 简单静态网页端编写，入门到HTML和css撰写以及几个简单js功能的实现能力。 较为丰富的Python使用经验（绝大部分项目的前段以及后端包括前后端的对接我都是通过Python语言实现的）以及Python编写能力。 入门到完整项目实现能力：现在对于较为入门的项目比如食堂、外卖等软件需求，阿黄基本上可以独立开发完成。 ​ 但是阿黄是一个高尚的人，是一个摆脱了低级趣味的人！阿黄最终希望自己进入“单机”游戏公司做3A单机游戏（是的，阿黄不玩网络游戏，甚至王者荣耀都不玩），阿黄希望自己深入研究游戏开发制作以及计算机图形学。为此，阿黄还需要： 学习unity引擎的使用方法，入门unity引擎的开发。 学习blender建模的方法。 学习计算机图形学。 ​ 能开发3A单机大作诸如“星空”之类是阿黄的梦想喵。 阿黄的兴趣爱好​ 任天堂他妈的是世界的主宰！ !](&#x2F;v2-460a8ccf0f4562fbf08e0303a1334bbc_r.jpg) ​ 阿黄从下玩任天堂游戏长大，从马里奥世界到新超级马里奥兄弟，从塞尔达传说：三角力量到塞尔达传说：时之笛以及后来的旷野之息，任天堂是世界的主宰！ ​ 阿黄还喜欢玩Steam游戏，阿黄的steam库已经有了两百多款游戏，但阿黄的总共游戏时间只有800个小时（因为TMD根本没时间玩）因为阿黄热爱学习。 !](&#x2F;Snipaste_2023-09-08_20-27-33.png) 阿黄的未来规划​ 回到我的成绩，很多人看到这样的成绩总是问阿黄，“阿黄你为什么不保研”，这是一个复杂的问题，但是归根到底是一句话“我要开心”，读生物的日子里我很没有成就感，我觉得我没有学到东西，这个学科让我失望，我希望我能够创造什么或者实现什么而不是单纯在实验里面打工，单纯在背书。 ​ 学计算机的日子虽然辛苦，但是给了我很大的成就感，但是人生总是有许多十字路口，我没不是总能得到我们想要的。对于我的未来，我的身体一直不好，我希望我今年也去考研，也去拼一把，但是我的眼睛一直不太好，今年八月份医生刚看到我眼底视网膜快裂开叫我打了激光，我很担心自己是否能承受高强度的学习压力，一方面也怪我没有把时间安排好，一方面我这个人总是追求极致，想着所有方面都做到最好，反而让身体承受不住，所以我希望在未来的三年中，我可以做到： ​ 1、第一年首先把身体养好：身体是革命的本钱，我可以在这段时间尝试去考研（福州大学本校），但首先最重要的是保重身体。首先我本人很胖，足足220斤，我希望我能减到150斤，并且保持近视度数不再增加，保护眼底视网膜健康。 ​ 2、第二年如果我可以考上，我希望我能以良好的身体状况去上研究生，如果我没法考上，我就找一份相对平和的工作，首先让身体进入良好的状态，再谈奋斗，再谈努力！在这段时间继续学习游戏制作的知识，为成为优秀游戏制作人打好基础 ​ 3、到了第三年无论如何尝试组建小团队，进行电子游戏的制作以及在steam上的售卖，尝试成为优秀的游戏制作人，同时在哔哩哔哩学习做自媒体尝试进行游戏的营销以及宣传工作。 ​ 这就是我所规划的阿黄未来的日子，阿黄要努力喵！","path":"2023/09/07/关注阿黄喵，关注阿黄谢谢喵！/"}],"categories":[],"tags":[]}